/**
 * Пакет для реалізації предметної області "Бак для сміття".
 */

/**
 * Інтерфейс, що представляє будь-який вид сміття.
 * Визначає базові методи для отримання об'єму та порівняння об'єктів.
 * Будь-який клас, що реалізує цей інтерфейс, може бути розміщений у сміттєвому баку.
 */
public interface Waste extends Comparable<Waste> {
    /**
     * Повертає об'єм сміття.
     * @return Об'єм у кубічних сантиметрах.
     */
    double getVolume();

    /**
     * Виводить повну інформацію про об'єкт сміття на консоль.
     */
    void printInfo();
}